# 第3章：建立與保存DataFrame

## 3.1 從無到有建立DataFrame

In [1]:
import pandas as pd
import numpy as np
#pd.set_option('max_columns', 4, 'max_rows', 10, 'max_colwidth', 12)

fname = ['Paul', 'John', 'Richard', 'George']
lname = ['McCartney', 'Lennon', 'Starkey', 'Harrison']
birth = [1942, 1940, 1940, 1943]

In [2]:
people = {'first': fname, 'last': lname, 'birth': birth}

In [3]:
beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [4]:
beatles.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
pd.DataFrame(people, index=['a', 'b', 'c', 'd'])

     first       last  birth
a     Paul  McCartney   1942
b     John     Lennon   1940
c  Richard    Starkey   1940
d   George   Harrison   1943

In [6]:
pd.DataFrame([{"first":"Paul","last":"McCartney", "birth":1942},
              {"first":"John","last":"Lennon", "birth":1940},
              {"first":"Richard","last":"Starkey", "birth":1940},
              {"first":"George","last":"Harrison", "birth":1943}])

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [7]:
pd.DataFrame([{"first":"Paul","last":"McCartney", "birth":1942},
              {"first":"John","last":"Lennon", "birth":1940},
              {"first":"Richard","last":"Starkey", "birth":1940},
              {"first":"George","last":"Harrison", "birth":1943}],
              columns=['last', 'first', 'birth'])

        last    first  birth
0  McCartney     Paul   1942
1     Lennon     John   1940
2    Starkey  Richard   1940
3   Harrison   George   1943

## 3.2 存取CSV檔案

In [8]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [9]:
from io import StringIO
fout = StringIO()
beatles.to_csv(fout)

In [10]:
print(fout.getvalue())

,first,last,birth
0,Paul,McCartney,1942
1,John,Lennon,1940
2,Richard,Starkey,1940
3,George,Harrison,1943

In [11]:
fout.seek(0)
pd.read_csv(fout)

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [12]:
_ = fout.seek(0)
pd.read_csv(fout, index_col=0)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [13]:
fout = StringIO()
beatles.to_csv(fout, index=False) 
print(fout.getvalue())

first,last,birth
Paul,McCartney,1942
John,Lennon,1940
Richard,Starkey,1940
George,Harrison,1943

## 3.3 讀取大型的CSV檔案

In [14]:
diamonds = pd.read_csv('data/diamonds.csv', nrows=1000)
diamonds

     carat      cut  ...     y     z
0     0.23    Ideal  ...  3.98  2.43
1     0.21  Premium  ...  3.84  2.31
2     0.23     Good  ...  4.07  2.31
3     0.29  Premium  ...  4.23  2.63
4     0.31     Good  ...  4.35  2.75
..     ...      ...  ...   ...   ...
995   0.54    Ideal  ...  5.34  3.26
996   0.72    Ideal  ...  5.74  3.57
997   0.72     Good  ...  5.89  3.48
998   0.74  Premium  ...  5.77  3.58
999   1.12  Premium  ...  6.61  4.03

[1000 rows x 10 columns]

In [15]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

In [16]:
diamonds2 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'x': np.float32,
                               'y': np.float32, 'z': np.float32,
                               'price': np.int16})

diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: float32(6), int16(1), object(3)
memory usage: 49.0+ KB

In [17]:
diamonds.describe()

             carat        depth  ...            y            z
count  1000.000000  1000.000000  ...  1000.000000  1000.000000
mean      0.689280    61.722800  ...     5.599180     3.457530
std       0.195291     1.758879  ...     0.611974     0.389819
min       0.200000    53.000000  ...     3.750000     2.270000
25%       0.700000    60.900000  ...     5.630000     3.450000
50%       0.710000    61.800000  ...     5.760000     3.550000
75%       0.790000    62.600000  ...     5.910000     3.640000
max       1.270000    69.500000  ...     7.050000     4.330000

[8 rows x 7 columns]

In [18]:
diamonds2.describe()

             carat        depth  ...            y            z
count  1000.000000  1000.000000  ...  1000.000000  1000.000000
mean      0.689281    61.722824  ...     5.599180     3.457533
std       0.195291     1.758878  ...     0.611972     0.389819
min       0.200000    53.000000  ...     3.750000     2.270000
25%       0.700000    60.900002  ...     5.630000     3.450000
50%       0.710000    61.799999  ...     5.760000     3.550000
75%       0.790000    62.599998  ...     5.910000     3.640000
max       1.270000    69.500000  ...     7.050000     4.330000

[8 rows x 7 columns]

In [19]:
diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [20]:
diamonds2.color.value_counts()

E    240
F    226
G    139
D    129
H    125
I     95
J     46
Name: color, dtype: int64

In [21]:
diamonds2.clarity.value_counts()

SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: clarity, dtype: int64

In [22]:
diamonds3 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'x': np.float32,
                               'y': np.float32, 'z': np.float32,
                               'price': np.int16,
                               'cut': 'category', 'color': 'category',
                               'clarity': 'category'})

diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: category(3), float32(6), int16(1)
memory usage: 29.4 KB

In [23]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds4 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'price': np.int16,
                               'cut': 'category', 'color': 'category',
                               'clarity': 'category'},
                        usecols=cols)

diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
dtypes: category(3), float32(3), int16(1)
memory usage: 17.7 KB

In [24]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds_iter = pd.read_csv('data/diamonds.csv', nrows=1000,
                            dtype={'carat': np.float32, 'depth': np.float32,
                                   'table': np.float32, 'price': np.int16,
                                   'cut': 'category', 'color': 'category',
                                   'clarity': 'category'},
                            usecols=cols,
                            chunksize=200)

def process(df):
    return f'processed {df.size} items'

for chunk in diamonds_iter:
    process(chunk)

In [25]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

### 小編補充

In [26]:
diamonds4['price'].min()

326

In [27]:
diamonds4['price'].max()

2898

In [28]:
np.finfo(np.float16)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [29]:
diamonds.price.memory_usage()

8128

In [30]:
diamonds.price.memory_usage(index=False)

8000

In [31]:
diamonds.cut.memory_usage(deep=True)

63461

In [32]:
!pip install pyarrow

Requirement already satisfied: pyarrow in c:\users\admin\anaconda3\lib\site-packages (4.0.0)
Requirement already satisfied: numpy>=1.16.6 in c:\users\admin\anaconda3\lib\site-packages (from pyarrow) (1.19.5)

In [33]:
diamonds4.to_feather('d.arr')
diamonds5 = pd.read_feather('d.arr')

In [34]:
diamonds4.to_parquet('d.pqt')

## 3.4 使用Excel檔案

In [35]:
!pip install xlwt

Requirement already satisfied: xlwt in c:\users\admin\anaconda3\lib\site-packages (1.3.0)

In [36]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\anaconda3\lib\site-packages (3.0.4)
Requirement already satisfied: jdcal in c:\users\admin\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\admin\anaconda3\lib\site-packages (from openpyxl) (1.0.1)

In [37]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\admin\anaconda3\lib\site-packages (1.2.0)

In [38]:
beatles.to_excel('beat.xls')

In [39]:
beatles.to_excel('beat.xlsx')

In [40]:
beat2 = pd.read_excel('beat.xls')
beat2

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [41]:
beat2 = pd.read_excel('beat.xls', index_col=0)
beat2

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [42]:
beat2.dtypes

first    object
last     object
birth     int64
dtype: object

In [43]:
xl_writer = pd.ExcelWriter('beat.xlsx')
beatles.to_excel(xl_writer, sheet_name='All')
beatles[beatles.birth < 1941].to_excel(xl_writer, sheet_name='1940')
xl_writer.save()

## 3.5 讀取ZIP檔案中的資料

In [44]:
autos = pd.read_csv('data/vehicles.csv.zip')
autos

C:\Users\Admin\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

       barrels08  barrelsA08  ...  phevHwy  phevComb
0      15.695714         0.0  ...        0         0
1      29.964545         0.0  ...        0         0
2      12.207778         0.0  ...        0         0
3      29.964545         0.0  ...        0         0
4      17.347895         0.0  ...        0         0
...          ...         ...  ...      ...       ...
39096  14.982273         0.0  ...        0         0
39097  14.330870         0.0  ...        0         0
39098  15.695714         0.0  ...        0         0
39099  15.695714         0.0  ...        0         0
39100  18.311667         0.0  ...        0         0

[39101 rows x 83 columns]

In [45]:
autos.modifiedOn.dtype

dtype('O')

In [46]:
autos.modifiedOn

0        Tue Jan ...
1        Tue Jan ...
2        Tue Jan ...
3        Tue Jan ...
4        Tue Jan ...
            ...
39096    Tue Jan ...
39097    Tue Jan ...
39098    Tue Jan ...
39099    Tue Jan ...
39100    Tue Jan ...
Name: modifiedOn, Length: 39101, dtype: object

In [47]:
pd.to_datetime(autos.modifiedOn)

C:\Users\Admin\anaconda3\lib\site-packages\dateutil\parser\_parser.py:1213: UnknownTimezoneWarning: tzname EST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "
C:\Users\Admin\anaconda3\lib\site-packages\dateutil\parser\_parser.py:1213: UnknownTimezoneWarning: tzname EDT identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [48]:
autos = pd.read_csv('data/vehicles.csv.zip', parse_dates=['modifiedOn'])  
autos.modifiedOn

C:\Users\Admin\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [49]:
import zipfile

In [50]:
with zipfile.ZipFile('data/kaggle-survey-2018.zip') as z:
    print('\n'.join(z.namelist()))
    kag = pd.read_csv(z.open('multipleChoiceResponses.csv'))
    kag_questions = kag.iloc[0]
    survey = kag.iloc[1:]

multipleChoiceResponses.csv
freeFormResponses.csv
SurveySchema.csv

C:\Users\Admin\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (0,2,8,10,21,23,24,25,26,27,28,44,56,64,83,85,87,107,109,123,125,150,157,172,174,194,210,218,219,223,246,249,262,264,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,304,306,325,326,329,341,368,371,384,385,389,390,391,393,394) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [51]:
survey.head(2).T

                        1          2
Time from...          710        434
Q1                 Female       Male
Q1_OTHER_...           -1         -1
Q2                  45-49      30-34
Q3            United S...  Indonesia
...                   ...        ...
Q50_Part_5            NaN        NaN
Q50_Part_6            NaN        NaN
Q50_Part_7            NaN        NaN
Q50_Part_8            NaN        NaN
Q50_OTHER...           -1         -1

[395 rows x 2 columns]

## 3.6 存取資料庫

In [52]:
import sqlite3
con = sqlite3.connect('data/beat.db')
with con:
    cur = con.cursor()
    cur.execute("""DROP TABLE Band""")
    cur.execute("""CREATE TABLE Band(id INTEGER PRIMARY KEY,
                   fname TEXT, lname TEXT, birthyear INT)""")
    cur.execute("""INSERT INTO Band VALUES(
                   0, 'Paul', 'McCartney', 1942)""")
    cur.execute("""INSERT INTO Band VALUES(
                   1, 'John', 'Lennon', 1940)""")
    _ = con.commit()

In [53]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\admin\anaconda3\lib\site-packages (1.3.18)

In [54]:
import sqlalchemy as sa
engine = sa.create_engine('sqlite:///data/beat.db', echo=True)
sa_connection = engine.connect()

beat = pd.read_sql('Band', sa_connection, index_col='id')
beat

2021-11-10 17:44:47,791 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2021-11-10 17:44:47,793 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,795 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2021-11-10 17:44:47,797 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,799 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("Band")
2021-11-10 17:44:47,801 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,804 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-11-10 17:44:47,805 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,890 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_xinfo("Band")
2021-11-10 17:44:47,892 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,894 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'Band' AND type = 'table'
2021-11-10 17:44:47,895 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,962 INFO sqlalchemy.engine.base.Engine PRAGMA main.foreign_key_list("Band")
2021-11-10 17:44:47,963 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,965 INFO sqlalchemy.engine.base.Engine PRAGMA temp.foreign_key_list("Band")
2021-11-10 17:44:47,965 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,967 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'Band' AND type = 'table'
2021-11-10 17:44:47,969 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,973 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2021-11-10 17:44:47,975 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,977 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2021-11-10 17:44:47,979 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,982 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2021-11-10 17:44:47,984 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,985 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2021-11-10 17:44:47,987 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,989 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'Band' AND type = 'table'
2021-11-10 17:44:47,990 INFO sqlalchemy.engine.base.Engine ()
2021-11-10 17:44:47,996 INFO sqlalchemy.engine.base.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2021-11-10 17:44:47,997 INFO sqlalchemy.engine.base.Engine ()

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [55]:
sql = '''SELECT fname, birthyear from Band'''
fnames = pd.read_sql(sql, con)
fnames

  fname  birthyear
0  Paul       1942
1  John       1940

## 3.7 存取JSON格式的資料

In [56]:
import json
encoded = json.dumps(people)
encoded

'{"first": ["Paul", "John", "Richard", "George"], "last": ["McCartney", "Lennon", "Starkey", "Harrison"], "birth": [1942, 1940, 1940, 1943]}'

In [57]:
json.loads(encoded)

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1942, 1940, 1940, 1943]}

In [58]:
beatles = pd.read_json(encoded)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [59]:
records = beatles.to_json(orient='records')
records

'[{"first":"Paul","last":"McCartney","birth":1942},{"first":"John","last":"Lennon","birth":1940},{"first":"Richard","last":"Starkey","birth":1940},{"first":"George","last":"Harrison","birth":1943}]'

In [60]:
pd.read_json(records, orient='records')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [61]:
split = beatles.to_json(orient='split')
split

'{"columns":["first","last","birth"],"index":[0,1,2,3],"data":[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]}'

In [62]:
pd.read_json(split, orient='split')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [63]:
index = beatles.to_json(orient='index')
index

'{"0":{"first":"Paul","last":"McCartney","birth":1942},"1":{"first":"John","last":"Lennon","birth":1940},"2":{"first":"Richard","last":"Starkey","birth":1940},"3":{"first":"George","last":"Harrison","birth":1943}}'

In [64]:
pd.read_json(index, orient='index')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [65]:
values = beatles.to_json(orient='values')
values

'[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]'

In [66]:
pd.read_json(values, orient='values')

         0          1     2
0     Paul  McCartney  1942
1     John     Lennon  1940
2  Richard    Starkey  1940
3   George   Harrison  1943

In [67]:
(pd.read_json(values, orient='values')
   .rename(columns=dict(enumerate(['first', 'last', 'birth'])))
)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [68]:
table = beatles.to_json(orient='table')
table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first","type":"string"},{"name":"last","type":"string"},{"name":"birth","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"first":"Paul","last":"McCartney","birth":1942},{"index":1,"first":"John","last":"Lennon","birth":1940},{"index":2,"first":"Richard","last":"Starkey","birth":1940},{"index":3,"first":"George","last":"Harrison","birth":1943}]}'

In [69]:
pd.read_json(table, orient='table')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [70]:
output = beat.to_dict()
output

{'fname': {0: 'Paul', 1: 'John'},
 'lname': {0: 'McCartney', 1: 'Lennon'},
 'birthyear': {0: 1942, 1: 1940}}

In [71]:
output['version'] = '0.4.1'
json.dumps(output)

'{"fname": {"0": "Paul", "1": "John"}, "lname": {"0": "McCartney", "1": "Lennon"}, "birthyear": {"0": 1942, "1": 1940}, "version": "0.4.1"}'

## 3.8 讀取HTML表格

In [1]:
!pip install lxml

Requirement already satisfied: lxml in c:\local\anaconda3\lib\site-packages (4.9.3)

In [3]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url)
len(dfs)

60

In [4]:
dfs[0]

  The Beatles discography The Beatles discography.1
0     The Beatles in 1965       The Beatles in 1965
1           Studio albums          12 (UK), 17 (US)
2             Live albums                         5
3      Compilation albums                        51
4            Video albums                        22
5            Music videos                        53
6                     EPs                        36
7                 Singles                        63
8                Mash-ups                         2
9                Box sets                        17

In [5]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url, match='List of studio albums', na_values='—')
len(dfs)

2

In [6]:
dfs[0].columns

MultiIndex([(               'Title',            'Title'),
            (    'Album details[A]', 'Album details[A]'),
            ('Peak chart positions',        'UK [8][9]'),
            ('Peak chart positions',         'AUS [10]'),
            ('Peak chart positions',         'CAN [11]'),
            ('Peak chart positions',         'FRA [12]'),
            ('Peak chart positions',         'GER [13]'),
            ('Peak chart positions',         'NOR [14]'),
            ('Peak chart positions',      'US [15][16]'),
            (      'Certifications',   'Certifications'),
            (               'Sales',            'Sales')],
           )

In [7]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url, match='List of studio albums', na_values='—',
                   header=[0,1])
len(dfs)

2

In [8]:
dfs[0]

                                                Title  \
                                                Title
0                                    Please Please Me
1                                 With the Beatles[B]
2                                  A Hard Day's Night
3                                    Beatles for Sale
4                                               Help!
5                                         Rubber Soul
6                                            Revolver
7               Sgt. Pepper's Lonely Hearts Club Band
8                     The Beatles ("The White Album")
9                                 Yellow Submarine[C]
10                                         Abbey Road
11                                          Let It Be
12  "—" denotes that the recording did not chart o...

                                     Album details[A]  \
                                     Album details[A]
0           Released: 22 March 1963 Label: Parlophone
1   Released: 22 November 1963 Label: Parlophone (...
2            Released: 10 July 1964 Label: Parlophone
3         Released: 4 December 1964 Label: Parlophone
4           Released: 6 August 1965 Label: Parlophone
5         Released: 3 December 1965 Label: Parlophone
6           Released: 5 August 1966 Label: Parlophone
7         Released: 26 May 1967[23] Label: Parlophone
8             Released: 22 November 1968 Label: Apple
9              Released: 17 January 1969 Label: Apple
10           Released: 26 September 1969 Label: Apple
11                  Released: 8 May 1970 Label: Apple
12  "—" denotes that the recording did not chart o...

                                 Peak chart positions  \
                                            UK [8][9]
0                                                   1
1                                                   1
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   3
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                             AUS [10]
0                                                 NaN
1                                                 NaN
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   4
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                             CAN [11]
0                                                 NaN
1                                                 NaN
2                                                 NaN
3                                                 NaN
4                                                 NaN
5                                                 NaN
6                                                 NaN
7                                                   1
8                                                   1
9                                                   1
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                             FRA [12]
0                                                   5
1                                                   5
2                                                 NaN
3                                                 NaN
4                                                   5
5                                                   5
6                                                   5
7                                                   4
8                                                   1
9                                                   4
10                                                  1
11                                                  5
12  "—" denotes that the recording did not chart o...

                                                       \
                                             GER [13]
0                                                   5
1                                                   1
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   5
10                                                  1
11                                                  4
12  "—" denotes that the recording did not chart o...

                                                       \
                                             NOR [14]
0                                                 NaN
1                                                 NaN
2                                                 NaN
3                                                 NaN
4                                                 NaN
5                                                 NaN
6                                                  14
7                                                   1
8                                                   1
9                                                   1
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                          US [15][16]
0                                                 155
1                                                 179
2                                                 NaN
3                                                 NaN
4                                                 NaN
5                                                 NaN
6                                                 NaN
7                                                   1
8                                                   1
9                                                   2
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                       Certifications  \
                                       Certifications
0   BPI: Platinum[17] ARIA: Gold[18] MC: Gold[19] ...
1   BPI: Gold[17] ARIA: Gold[18] BVMI: Gold[21] MC...
2                    BPI: Platinum[17] ARIA: Gold[18]
3   BPI: Gold[17] ARIA: Gold[18] MC: Gold[19] RIAA...
4                    BPI: Platinum[17] ARIA: Gold[18]
5   BPI: 2× Platinum[17] ARIA: Platinum[18] BVMI: ...
6             BPI: 2× Platinum[17] ARIA: Platinum[18]
7   BPI: 18× Platinum[17] ARIA: 4× Platinum[18] BV...
8   BPI: 2× Platinum[17] ARIA: 2× Platinum[18] MC:...
9       BPI: Gold[17] MC: Gold[19] RIAA: Platinum[20]
10  BPI: 8× Platinum[17] ARIA: 3× Platinum[18] BVM...
11  BPI: Platinum[17] ARIA: Platinum[18] MC: 3× Pl...
12  "—" denotes that the recording did not chart o...

                                                Sales
                                                Sales
0                                                 NaN
1                                                 NaN
2                                                 NaN
3                                     UK: 750,000[22]
4                                                 NaN
5                                                 NaN
6                                                 NaN
7                                   UK: 5,340,000[25]
8                                                 NaN
9                                                 NaN
10                                  UK: 2,240,608[27]
11                                                NaN
12  "—" denotes that the recording did not chart o...

In [10]:
df = dfs[0]
df.columns = ['Title', 'Release', 'UK', 'AUS', 'CAN', 'FRA', 'GER',
              'NOR', 'US', 'Certifications', 'Sales']
df

,Title,Release,UK,AUS,CAN,FRA,GER,NOR,US,Certifications,Sales
0,Please Please Me,Released: 22 March 1963 Label: Parlophone,1,NaN,NaN,5,5,NaN,155,BPI: Platinum[17] ARIA: Gold[18] MC: Gold[19] ...,NaN
1,With the Beatles[B],Released: 22 November 1963 Label: Parlophone (...,1,NaN,NaN,5,1,NaN,179,BPI: Gold[17] ARIA: Gold[18] BVMI: Gold[21] MC...,NaN
2,A Hard Day's Night,Released: 10 July 1964 Label: Parlophone,1,1,NaN,NaN,1,NaN,NaN,BPI: Platinum[17] ARIA: Gold[18],NaN
3,Beatles for Sale,Released: 4 December 1964 Label: Parlophone,1,1,NaN,NaN,1,NaN,NaN,BPI: Gold[17] ARIA: Gold[18] MC: Gold[19] RIAA...,"UK: 750,000[22]"
4,Help!,Released: 6 August 1965 Label: Parlophone,1,1,NaN,5,1,NaN,NaN,BPI: Platinum[17] ARIA: Gold[18],NaN
5,Rubber Soul,Released: 3 December 1965 Label: Parlophone,1,1,NaN,5,1,NaN,NaN,BPI: 2× Platinum[17] ARIA: Platinum[18] BVMI: ...,NaN
6,Revolver,Released: 5 August 1966 Label: Parlophone,1,1,NaN,5,1,14,NaN,BPI: 2× Platinum[17] ARIA: Platinum[18],NaN
7,Sgt. Pepper's Lonely Hearts Club Band,Released: 26 May 1967[23] Label: Parlophone,1,1,1,4,1,1,1,BPI: 18× Platinum[17] ARIA: 4× Platinum[18] BV...,"UK: 5,340,000[25]"
8,"The Beatles (""The White Album"")",Released: 22 November 1968 Label: Apple,1,1,1,1,1,1,1,BPI: 2× Platinum[17] ARIA: 2× Platinum[18] MC:...,NaN
9,Yellow Submarine[C],Released: 17 January 1969 Label: Apple,3,4,1,4,5,1,2,BPI: Gold[17] MC: Gold[19] RIAA: Platinum[20],NaN
10,Abbey Road,Released: 26 September 1969 Label: Apple,1,1,1,1,1,1,1,BPI: 8× Platinum[17] ARIA: 3× Platinum[18] BVM...,"UK: 2,240,608[27]"
11,Let It Be,Released: 8 May 1970 Label: Apple,1,1,1,5,4,1,1,BPI: Platinum[17] ARIA: Platinum[18] MC: 3× Pl...,NaN
12,"""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o...","""—"" denotes that the recording did not chart o..."

In [12]:
!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in c:\local\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\local\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
   ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
   ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
   --- ------------------------------------ 10.2/112.2 kB ? eta -:--:--
   -------------- ------------------------ 41.0/112.2 kB 393.8 kB/s eta 0:00:01
   ---------------------------- ---------- 81.9/112.2 kB 573.4 kB/s eta 0:00:01
   -------------------------------------- 112.2/112.2 kB 649.3 kB/s eta 0:00:00
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [21]:
import html5lib
import lxml
from bs4 import BeautifulSoup
import pandas as pd

In [22]:
html5lib.__version__

'1.1'

In [11]:
url = 'https://github.com/mattharrison/datasets/blob/master/data/anscombes.csv'
dfs = pd.read_html(url, attrs={'class': 'csv-data'})
len(dfs)

ValueError: No tables found

In [82]:
dfs[0]

    Unnamed: 0 quadrant     x     y
0          NaN        I  10.0  8.04
1          NaN        I  14.0  9.96
2          NaN        I   6.0  7.24
3          NaN        I   9.0  8.81
4          NaN        I   4.0  4.26
..         ...      ...   ...   ...
39         NaN       IV   8.0  6.58
40         NaN       IV   8.0  7.91
41         NaN       IV   8.0  8.47
42         NaN       IV   8.0  5.25
43         NaN       IV   8.0  6.89

[44 rows x 4 columns]